; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-3-9)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-1 - location
	p0-2 - location
	p0-4 - location
	p1-0 - location
	p1-4 - location
	p2-0 - location
	p2-3 - location
	p3-2 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s4)
	(at driver3 s1)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s3)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at package1 s4)
	(at package2 s1)
	(at package3 s4)
	(at package4 s4)
	(at package5 s3)
	(at package6 s0)
	(at package7 s3)
	(at package8 s3)
	(at package9 s2)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 62)
	(= (time-to-walk p0-1 s0) 62)
	(= (time-to-walk s1 p0-1) 48)
	(= (time-to-walk p0-1 s1) 48)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 64)
	(= (time-to-walk p0-2 s0) 64)
	(= (time-to-walk s2 p0-2) 58)
	(= (time-to-walk p0-2 s2) 58)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(= (time-to-walk s0 p0-4) 45)
	(= (time-to-walk p0-4 s0) 45)
	(= (time-to-walk s4 p0-4) 25)
	(= (time-to-walk p0-4 s4) 25)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 63)
	(= (time-to-walk p1-4 s1) 63)
	(= (time-to-walk s4 p1-4) 65)
	(= (time-to-walk p1-4 s4) 65)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 56)
	(= (time-to-walk p2-3 s2) 56)
	(= (time-to-walk s3 p2-3) 99)
	(= (time-to-walk p2-3 s3) 99)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 53)
	(= (time-to-drive s4 s0) 53)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 71)
	(= (time-to-drive s0 s1) 71)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 86)
	(= (time-to-drive s2 s1) 86)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 52)
	(= (time-to-drive s3 s1) 52)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 69)
	(= (time-to-drive s0 s2) 69)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 96)
	(= (time-to-drive s4 s2) 96)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 15)
	(= (time-to-drive s0 s3) 15)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 64)
	(= (time-to-drive s2 s3) 64)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 94)
	(= (time-to-drive s3 s4) 94)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s4)
	(at driver2 s3)
	(at truck1 s0)
	(at truck3 s2)
	(at package2 s1)
	(at package3 s0)
	(at package4 s4)
	(at package5 s4)
	(at package6 s4)
	(at package7 s1)
	(at package8 s3)
	(at package9 s1)
	))

(:metric minimize (+ (+ (* 2  (total-time)) (* 3  (driven))) (* 3  (walked))))

)

; plan
1. (walk driver2 s4 p0-4)
   deleted: (at driver2 s4)
   added: (at driver2 p0-4)
   changed: (walked) from 0 to 25
   goals met: 4 of 12
2. (load-truck package6 truck3 s0)
   deleted: (at package6 s0)
   added: (in package6 truck3)
   goals met: 4 of 12
3. (walk driver2 p0-4 s0)
   deleted: (at driver2 p0-4)
   added: (at driver2 s0)
   changed: (walked) from 25 to 70
   goals met: 4 of 12
4. (walk driver2 s0 p0-2)
   deleted: (at driver2 s0)
   added: (at driver2 p0-2)
   changed: (walked) from 70 to 134
   goals met: 4 of 12
5. (load-truck package9 truck1 s2)
   deleted: (at package9 s2)
   added: (in package9 truck1)
   goals met: 4 of 12
6. (walk driver2 p0-2 s2)
   deleted: (at driver2 p0-2)
   added: (at driver2 s2)
   changed: (walked) from 134 to 192
   goals met: 4 of 12
7. (board-truck driver2 truck1 s2)
   deleted: (at driver2 s2) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 4 of 12
8. (drive-truck truck1 s2 s0 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (driven) from 0 to 69
   goals met: 5 of 12
9. (unload-truck package6 truck3 s0)
   deleted: (in package6 truck3)
   added: (at package6 s0)
   goals met: 5 of 12
10. (load-truck package6 truck1 s0)
   deleted: (at package6 s0)
   added: (in package6 truck1)
   goals met: 5 of 12
11. (drive-truck truck1 s0 s4 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   changed: (driven) from 69 to 122
   goals met: 4 of 12
12. (load-truck package3 truck1 s4)
   deleted: (at package3 s4)
   added: (in package3 truck1)
   goals met: 4 of 12
13. (drive-truck truck1 s4 s0 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (driven) from 122 to 175
   goals met: 5 of 12
14. (unload-truck package3 truck1 s0)
   deleted: (in package3 truck1)
   added: (at package3 s0)
   goals met: 6 of 12
15. (drive-truck truck1 s0 s3 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   changed: (driven) from 175 to 190
   goals met: 5 of 12
16. (load-truck package5 truck1 s3)
   deleted: (at package5 s3)
   added: (in package5 truck1)
   goals met: 5 of 12
17. (load-truck package7 truck1 s3)
   deleted: (at package7 s3)
   added: (in package7 truck1)
   goals met: 5 of 12
18. (drive-truck truck1 s3 s4 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   changed: (driven) from 190 to 284
   goals met: 5 of 12
19. (unload-truck package5 truck1 s4)
   deleted: (in package5 truck1)
   added: (at package5 s4)
   goals met: 6 of 12
20. (unload-truck package6 truck1 s4)
   deleted: (in package6 truck1)
   added: (at package6 s4)
   goals met: 7 of 12
21. (drive-truck truck1 s4 s0 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (driven) from 284 to 337
   goals met: 8 of 12
22. (drive-truck truck1 s0 s1 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (driven) from 337 to 408
   goals met: 7 of 12
23. (unload-truck package9 truck1 s1)
   deleted: (in package9 truck1)
   added: (at package9 s1)
   goals met: 8 of 12
24. (walk driver1 s4 p0-4)
   deleted: (at driver1 s4)
   added: (at driver1 p0-4)
   changed: (walked) from 192 to 217
   goals met: 7 of 12
25. (walk driver1 p0-4 s0)
   deleted: (at driver1 p0-4)
   added: (at driver1 s0)
   changed: (walked) from 217 to 262
   goals met: 7 of 12
26. (board-truck driver1 truck3 s0)
   deleted: (at driver1 s0) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 7 of 12
27. (drive-truck truck1 s1 s3 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   changed: (driven) from 408 to 460
   goals met: 7 of 12
28. (disembark-truck driver2 truck1 s3)
   deleted: (driving driver2 truck1)
   added: (at driver2 s3) (empty truck1)
   goals met: 8 of 12
29. (unload-truck package7 truck1 s3)
   deleted: (in package7 truck1)
   added: (at package7 s3)
   goals met: 8 of 12
30. (drive-truck truck3 s0 s1 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (driven) from 460 to 531
   goals met: 8 of 12
31. (board-truck driver2 truck1 s3)
   deleted: (at driver2 s3) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 7 of 12
32. (load-truck package7 truck1 s3)
   deleted: (at package7 s3)
   added: (in package7 truck1)
   goals met: 7 of 12
33. (drive-truck truck1 s3 s1 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   changed: (driven) from 531 to 583
   goals met: 7 of 12
34. (disembark-truck driver2 truck1 s1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s1) (empty truck1)
   goals met: 7 of 12
35. (drive-truck truck3 s1 s2 driver1)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (driven) from 583 to 669
   goals met: 8 of 12
36. (unload-truck package7 truck1 s1)
   deleted: (in package7 truck1)
   added: (at package7 s1)
   goals met: 9 of 12
37. (board-truck driver3 truck1 s1)
   deleted: (at driver3 s1) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 9 of 12
38. (drive-truck truck1 s1 s0 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (driven) from 669 to 740
   goals met: 10 of 12
39. (drive-truck truck3 s2 s4 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s4)
   changed: (driven) from 740 to 836
   goals met: 9 of 12
40. (disembark-truck driver3 truck1 s0)
   deleted: (driving driver3 truck1)
   added: (at driver3 s0) (empty truck1)
   goals met: 9 of 12
41. (walk driver2 s1 p0-1)
   deleted: (at driver2 s1)
   added: (at driver2 p0-1)
   changed: (walked) from 262 to 310
   goals met: 9 of 12
42. (walk driver2 p0-1 s0)
   deleted: (at driver2 p0-1)
   added: (at driver2 s0)
   changed: (walked) from 310 to 372
   goals met: 9 of 12
43. (disembark-truck driver1 truck3 s4)
   deleted: (driving driver1 truck3)
   added: (at driver1 s4) (empty truck3)
   goals met: 10 of 12
44. (board-truck driver3 truck1 s0)
   deleted: (at driver3 s0) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 10 of 12
45. (drive-truck truck1 s0 s3 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   changed: (driven) from 836 to 851
   goals met: 9 of 12
46. (disembark-truck driver3 truck1 s3)
   deleted: (driving driver3 truck1)
   added: (at driver3 s3) (empty truck1)
   goals met: 9 of 12
47. (walk driver2 s0 p0-2)
   deleted: (at driver2 s0)
   added: (at driver2 p0-2)
   changed: (walked) from 372 to 436
   goals met: 9 of 12
48. (board-truck driver3 truck1 s3)
   deleted: (at driver3 s3) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 9 of 12
49. (drive-truck truck1 s3 s0 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   changed: (driven) from 851 to 866
   goals met: 10 of 12
50. (board-truck driver1 truck3 s4)
   deleted: (at driver1 s4) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 9 of 12
51. (drive-truck truck3 s4 s2 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s2)
   changed: (driven) from 866 to 962
   goals met: 10 of 12
52. (disembark-truck driver1 truck3 s2)
   deleted: (driving driver1 truck3)
   added: (at driver1 s2) (empty truck3)
   goals met: 10 of 12
53. (walk driver2 p0-2 s2)
   deleted: (at driver2 p0-2)
   added: (at driver2 s2)
   changed: (walked) from 436 to 494
   goals met: 10 of 12
54. (board-truck driver2 truck3 s2)
   deleted: (at driver2 s2) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 10 of 12
55. (drive-truck truck3 s2 s3 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   changed: (driven) from 962 to 1026
   goals met: 9 of 12
56. (disembark-truck driver2 truck3 s3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s3) (empty truck3)
   goals met: 10 of 12
57. (drive-truck truck1 s0 s4 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s4)
   changed: (driven) from 1026 to 1079
   goals met: 9 of 12
58. (disembark-truck driver3 truck1 s4)
   deleted: (driving driver3 truck1)
   added: (at driver3 s4) (empty truck1)
   goals met: 9 of 12
59. (walk driver1 s2 p0-2)
   deleted: (at driver1 s2)
   added: (at driver1 p0-2)
   changed: (walked) from 494 to 552
   goals met: 9 of 12
60. (board-truck driver3 truck1 s4)
   deleted: (at driver3 s4) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 9 of 12
61. (drive-truck truck1 s4 s0 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (driven) from 1079 to 1132
   goals met: 10 of 12
62. (board-truck driver2 truck3 s3)
   deleted: (at driver2 s3) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 9 of 12
63. (drive-truck truck3 s3 s2 driver2)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   changed: (driven) from 1132 to 1196
   goals met: 10 of 12
64. (drive-truck truck1 s0 s2 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (driven) from 1196 to 1265
   goals met: 9 of 12
65. (disembark-truck driver2 truck3 s2)
   deleted: (driving driver2 truck3)
   added: (at driver2 s2) (empty truck3)
   goals met: 9 of 12
66. (walk driver2 s2 p2-3)
   deleted: (at driver2 s2)
   added: (at driver2 p2-3)
   changed: (walked) from 552 to 608
   goals met: 9 of 12
67. (drive-truck truck1 s2 s0 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (driven) from 1265 to 1334
   goals met: 10 of 12
68. (walk driver2 p2-3 s3)
   deleted: (at driver2 p2-3)
   added: (at driver2 s3)
   changed: (walked) from 608 to 707
   goals met: 11 of 12
69. (walk driver1 p0-2 s0)
   deleted: (at driver1 p0-2)
   added: (at driver1 s0)
   changed: (walked) from 707 to 771
   goals met: 11 of 12
70. (walk driver1 s0 p0-4)
   deleted: (at driver1 s0)
   added: (at driver1 p0-4)
   changed: (walked) from 771 to 816
   goals met: 11 of 12
71. (walk driver1 p0-4 s4)
   deleted: (at driver1 p0-4)
   added: (at driver1 s4)
   changed: (walked) from 816 to 841
   goals met: 12 of 12
